In [11]:
import requests
import pandas as pd
from datetime import date, timedelta

In [12]:
# get json for today

with open("data_source.txt", "r") as data_source:
    url = data_source.readline()

resp = requests.get(url.strip())

In [13]:
today_data = resp.json()['data']
today_data

[{'AgeGroup': '0-9', 'Cases': 847},
 {'AgeGroup': '10-19', 'Cases': 1103},
 {'AgeGroup': '20-29', 'Cases': 1177},
 {'AgeGroup': '30-39', 'Cases': 1552},
 {'AgeGroup': '40-49', 'Cases': 1398},
 {'AgeGroup': '50-59', 'Cases': 1188},
 {'AgeGroup': '60-69', 'Cases': 894},
 {'AgeGroup': '70-79', 'Cases': 483},
 {'AgeGroup': '80-89', 'Cases': 246},
 {'AgeGroup': '90+', 'Cases': 82}]

In [14]:
df_today = pd.json_normalize(today_data)
df_today

  AgeGroup  Cases
0      0-9    847
1    10-19   1103
2    20-29   1177
3    30-39   1552
4    40-49   1398
5    50-59   1188
6    60-69    894
7    70-79    483
8    80-89    246
9      90+     82

In [15]:
# store today's data (for all ages) in csv

date_str = date.today().isoformat()
df_today.to_csv("../data/daily csvs/" + date_str + ".csv")

In [16]:
# now open CSV containing all dates

df_all = pd.read_csv("../data/cases_0_19.csv", index_col = 0)

In [17]:
df_all.tail()

           date  cases_0_9  cases_10_19
157  2022-05-20        962         1086
158  2022-05-21        841         1056
159  2022-05-22        705          837
160  2022-05-23        612          811
161  2022-05-24        884         1231

In [18]:
today = date.today()

df_all = df_all.append({'date': today.isoformat(), 'cases_0_9': df_today.loc[0, 'Cases'], 
                          'cases_10_19': df_today.loc[1, 'Cases']}, ignore_index = True)

C:\Users\amanj\AppData\Local\Temp\ipykernel_8712\4141770180.py:3: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  df_all = df_all.append({'date': today.isoformat(), 'cases_0_9': df_today.loc[0, 'Cases'],

In [19]:
df_all.tail()

           date  cases_0_9  cases_10_19
158  2022-05-21        841         1056
159  2022-05-22        705          837
160  2022-05-23        612          811
161  2022-05-24        884         1231
162  2022-05-25        847         1103

In [20]:
df_all.to_csv("../data/cases_0_19.csv")